# Project 5: Working with Pandas and SQL Databases (Movies Dataset)

# Project Brief for Self-Coders

Here you´ll have the opportunity to code major parts of Project 5 on your own. If you need any help or inspiration, have a look at the Videos or the Jupyter Notebook with the full code. <br> <br>
Keep in mind that it´s all about __getting the right results/conclusions__. It´s not about finding the identical code. Things can be coded in many different ways. Even if you come to the same conclusions, it´s very unlikely that we have the very same code.

## Creating an SQLite Database

1. __Import__ sqlite3 (as sq3) and __create__ a new SQLite Database with the name __"movies.db"__.

In [7]:
import sqlite3 as sq3
import json
import numpy as np 
import pandas as pd 
import ast
#from pandas.io.json import json_normalize

## Loading Data from DataFrames into an SQLite Database

2. __Load__ the json file __"some_movies.json"__ and __split__ the dataset into the following __four datasets__ (save each dataset in a Pandas DataFrame).

In [27]:
with open('some_movies.json') as f:
    df = json.load(f)

In [18]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.head()

,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,/orjiB3oUIsyz60hoEqkiGpy5CeO.jpg,"{'id': 86311, 'name': 'The Avengers Collection...",356000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...",https://www.marvel.com/movies/avengers-endgame,299534,tt4154796,en,Avengers: Endgame,...,2019-04-24,2797800564,181,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Part of the journey is the end.,Avengers: Endgame,False,8.3,12607
1,False,/wcC7kCICL6x6zHUlUyNp9pWoqW1.jpg,"{'id': 87096, 'name': 'Avatar Collection', 'po...",237000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.avatarmovie.com/,19995,tt0499549,en,Avatar,...,2009-12-10,2787965087,162,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Enter the World of Pandora.,Avatar,False,7.4,21000
2,False,/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg,"{'id': 10, 'name': 'Star Wars Collection', 'po...",245000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.starwars.com/films/star-wars-episod...,140607,tt2488496,en,Star Wars: The Force Awakens,...,2015-12-15,2068223624,136,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Every generation has a story.,Star Wars: The Force Awakens,False,7.4,14205
3,False,/lmZFxXgJE3vgrciwuDib0N8CfQo.jpg,"{'id': 86311, 'name': 'The Avengers Collection...",300000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",https://www.marvel.com/movies/avengers-infinit...,299536,tt4154756,en,Avengers: Infinity War,...,2018-04-25,2046239637,149,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,An entire universe. Once and for all.,Avengers: Infinity War,False,8.3,17718
4,False,/6VmFqApQRyZZzmiGOQq2C92jyvH.jpg,None,200000000,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",,597,tt0120338,en,Titanic,...,1997-11-18,1845034188,194,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Nothing on Earth could come between them.,Titanic,False,7.8,16661

In [10]:
con = sq3.connect('movies.db')

In [11]:
con.close()

In [23]:
#df = pd.read_json('some_movies.json', orient = 'values')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 25 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  18 non-null     bool
 1   backdrop_path          18 non-null     object
 2   belongs_to_collection  15 non-null     object
 3   budget                 18 non-null     int64
 4   genres                 18 non-null     object
 5   homepage               18 non-null     object
 6   id                     18 non-null     int64
 7   imdb_id                18 non-null     object
 8   original_language      18 non-null     object
 9   original_title         18 non-null     object
 10  overview               18 non-null     object
 11  popularity             18 non-null     float64
 12  poster_path            18 non-null     object
 13  production_companies   18 non-null     object
 14  production_countries   18 non-null     object
 15  release_date           18 non-null     object
 16  revenue                18 non-null     int64
 17  runtime                18 non-null     int64
 18  spoken_languages       18 non-null     object
 19  status                 18 non-null     object
 20  tagline                18 non-null     object
 21  title                  18 non-null     object
 22  video                  18 non-null     bool
 23  vote_average           18 non-null     float64
 24  vote_count             18 non-null     int64
dtypes: bool(2), float64(2), int64(5), object(16)
memory usage: 3.4+ KB

__Dataset #1 (Movies)__ with columns ["id", "title", "revenue", "budget", "belongs_to_collection_name", "release_date"]. <br>
Convert "release_date" to datetime and transform "budget" and "revenue" to Million USD before loading into the Database.

<h3 style ="color: green"> Transforming Revenue and budget by division of Million USD

In [11]:
df.revenue/1_000_000

In [49]:
df.budget/1_000_000

0     0.002798
1     0.002788
2     0.002068
3     0.002046
4     0.001845
5     0.001672
6     0.001657
7     0.001520
8     0.001515
9     0.001405
10    0.001347
11    0.001342
12    0.001333
13    0.001331
14    0.001303
15    0.001274
16    0.001264
17    0.001242
Name: revenue, dtype: float64

<h3 style="color:green"> Extracting the belongs_to_collection_name from df

In [32]:
belongs = df.belongs_to_collection.to_dict()

In [33]:
belongs = pd.DataFrame(belongs).T

In [35]:
belongs.head(2)

,id,name,poster_path,backdrop_path
0,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg
1,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg

<h3 style ="color: red"> Belongs_to_collection_name is in the  belongs_to_collection

<h3 style ="color: darkgreen"> Movies DataFrame without Belongs_to_collection column created

In [36]:
movies = df[['id', 'title', "revenue", "budget","release_date"]]

<h1 style="color:red"> Though it gives an indication prompt it works

In [37]:
movies['belongs_to_collection_name'] = belongs.name

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [38]:
movies.head(3)

,id,title,revenue,budget,release_date,belongs_to_collection_name
0,299534,Avengers: Endgame,2797800564,356000000,2019-04-24,The Avengers Collection
1,19995,Avatar,2787965087,237000000,2009-12-10,Avatar Collection
2,140607,Star Wars: The Force Awakens,2068223624,245000000,2015-12-15,Star Wars Collection

In [39]:
new_columns = ["id", "title", "revenue", "budget", "belongs_to_collection_name", "release_date"]

In [40]:
movies = movies[new_columns]

In [41]:
movies.head(3)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,299534,Avengers: Endgame,2797800564,356000000,The Avengers Collection,2019-04-24
1,19995,Avatar,2787965087,237000000,Avatar Collection,2009-12-10
2,140607,Star Wars: The Force Awakens,2068223624,245000000,Star Wars Collection,2015-12-15

<h3 style ="color: red"> Release_date to DateTime object conversion

In [42]:
movies.release_date = pd.to_datetime(movies.release_date)

__Dataset #2 (Votes)__ with columns ["id", "vote_count", "vote_average"].

In [43]:
Votes = df[["id", "vote_count", "vote_average"]]

In [44]:
Votes.head(2)

       id  vote_count  vote_average
0  299534       12607           8.3
1   19995       21000           7.4

__Dataset #3 (Genres)__ with columns separate names with |. <br>

In [22]:
#Genres = pd.DataFrame(df.genres)

In [29]:
Genres  = pd.json_normalize(data=df, record_path='genres', record_prefix='genre_')

In [30]:
Genres

    genre_id       genre_name
0         12        Adventure
1        878  Science Fiction
2         28           Action
3         28           Action
4         12        Adventure
5         14          Fantasy
6        878  Science Fiction
7         28           Action
8         12        Adventure
9        878  Science Fiction
10        14          Fantasy
11        12        Adventure
12        28           Action
13       878  Science Fiction
14        18            Drama
15     10749          Romance
16        28           Action
17        12        Adventure
18       878  Science Fiction
19        53         Thriller
20        12        Adventure
21     10751           Family
22       878  Science Fiction
23        28           Action
24        12        Adventure
25        28           Action
26        53         Thriller
27        28           Action
28        12        Adventure
29       878  Science Fiction
30        28           Action
31        12        Adventure
32        14          Fantasy
33       878  Science Fiction
34        14          Fantasy
35        12        Adventure
36       878  Science Fiction
37        28           Action
38        12        Adventure
39        16        Animation
40     10751           Family
41        12        Adventure
42        28           Action
43        12        Adventure
44       878  Science Fiction
45        16        Animation
46        12        Adventure
47     10751           Family
48     10751           Family
49        14          Fantasy
50     10749          Romance
51        28           Action
52        12        Adventure
53        16        Animation
54     10751           Family

In [24]:
Genres  = df.genres.to_dict()

In [48]:
#Genres = pd.DataFrame(Genres, index = ["id", "name"]).T

In [49]:
#Genres

In [ ]:
#Genres  = df[["genre_id", "genre_name", "id"]]

In [50]:
#df.info()

__Dataset #4 (Prod)__ with columns ["comp_id", "comp_logo_path", "comp_name", "comp_origin_country", "id" ]. <br>

In [51]:
#df.prod

In [52]:
#df.belongs_to_collection[1]['name']

3. __Load__ the datasets __into the database__ (each dataset should be a separate table in the database). __Name__ the tables "Movies", "Votes", "Genres", "Prod".

## Loading Data from SQLite Databases into DataFrames

4. __Load__ the full tables "Movies", "Votes", "Genres", "Prod" from "movies.db" into Pandas (four DataFrames). __Set__ "id" as Index.

In [53]:
con = sq3.connect('movies.db')

In [56]:
#Votes.to_sql('Votes', con,  index = False)

In [ ]:
#Movies.to_sql('Votes', con,  index = False)

In [57]:
con.execute('SELECT * FROM sqlite_master').fetchall()

[('table',
  'Movies',
  'Movies',
  2,
  'CREATE TABLE "Movies" (\n"id" INTEGER,\n  "title" TEXT,\n  "revenue" REAL,\n  "budget" REAL,\n  "belongs_to_collection_name" TEXT,\n  "release_date" TIMESTAMP\n)'),
 ('table',
  'Votes',
  'Votes',
  3,
  'CREATE TABLE "Votes" (\n"id" INTEGER,\n  "vote_count" INTEGER,\n  "vote_average" REAL\n)')]

In [26]:
pd.__version__

'1.2.4'

##  Some Simple SQL Queries

5. __Perform__ the following simple __SQL Queries__ and __store__ the results in DataFrames:

__Load the full "Movies" Table__.

In [58]:
df = pd.read_sql('SELECT * FROM Movies', con, index_col = 'id', parse_dates = ['release_dates'])

In [59]:
df.head(2)

,title,revenue,budget,belongs_to_collection_name,release_date
id,,,,,
299534,Avengers: Endgame,2797.800564,356.0,The Avengers Collection,2019-04-24 00:00:00
19995,Avatar,2787.965087,237.0,Avatar Collection,2009-12-10 00:00:00

__Load the columns "id", "revenue" and "release_date" from "Movies".__

In [69]:
pd.read_sql('SELECT Movies.id, Movies.revenue, Movies.release_date FROM Movies', con, index_col = 'id').head(3)

            revenue         release_date
id
299534  2797.800564  2019-04-24 00:00:00
19995   2787.965087  2009-12-10 00:00:00
140607  2068.223624  2015-12-15 00:00:00

__Get the Total Revenue (sum) over all movies from "Movies".__

In [74]:
pd.read_sql('SELECT sum(Movies.revenue) FROM Movies',con)

   sum(Movies.revenue)
0         29748.575327

__Count the number of Movies in "Movies".__

In [98]:
pd.read_sql('SELECT count(Movies.title) FROM Movies', con)

   count(Movies.title)
0                   18

__Count the number of Movies that do belong to a collection.__

In [80]:
pd.read_sql('SELECT count(Movies.belongs_to_collection_name) FROM Movies', con)

   count(Movies.belongs_to_collection_name)
0                                        15

__Get the average budget from "Movies"__.

In [81]:
pd.read_sql('SELECT avg(Movies.budget) FROM Movies', con)

   avg(Movies.budget)
0          209.055556

## Some more SQL Queries

6. __Perform__ the following advanced __SQL Queries__ and __store__ the results in DataFrames:

__Load all columns for the movie with movie id 597__.

In [85]:
pd.read_sql('SELECT * FROM Movies WHERE id=597', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,597,Titanic,1845.034188,200.0,None,1997-11-18 00:00:00

__Load all columns for all movies with a revenue greater than 2000 (MUSD).__

In [86]:
pd.read_sql('SELECT * FROM Movies WHERE revenue>2000', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,299534,Avengers: Endgame,2797.800564,356.0,The Avengers Collection,2019-04-24 00:00:00
1,19995,Avatar,2787.965087,237.0,Avatar Collection,2009-12-10 00:00:00
2,140607,Star Wars: The Force Awakens,2068.223624,245.0,Star Wars Collection,2015-12-15 00:00:00
3,299536,Avengers: Infinity War,2046.239637,300.0,The Avengers Collection,2018-04-25 00:00:00

__Load all columns for all movies with a revenue greater than 1500 (MUSD) and a budget below 200 (MUSD).__

In [87]:
pd.read_sql('SELECT * FROM Movies WHERE revenue>1500 AND budget<200', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,135397,Jurassic World,1671.713208,150.0,Jurassic Park Collection,2015-06-06 00:00:00
1,168259,Furious 7,1515.047671,190.0,The Fast and the Furious Collection,2015-04-01 00:00:00

__Get the minimum budget from those movies with a revenue greater than 1250 (MUSD).__

In [95]:
pd.read_sql('SELECT MIN(Movies.budget) FROM Movies WHERE revenue>1250', con)

   MIN(Movies.budget)
0               125.0

__Get all unique collection Names from "Movies".__

In [ ]:
pd.read_sql('SELECT * FROM Movies WHERE revenue>2000', con)

__Load all movies (all columns) and sort by budget from high to low.__

In [109]:
pd.read_sql('SELECT * FROM Movies ORDER BY budget DESC', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,299534,Avengers: Endgame,2797.800564,356.0,The Avengers Collection,2019-04-24 00:00:00
1,299536,Avengers: Infinity War,2046.239637,300.0,The Avengers Collection,2018-04-25 00:00:00
2,420818,The Lion King,1656.943394,260.0,None,2019-07-12 00:00:00
3,99861,Avengers: Age of Ultron,1405.403694,250.0,The Avengers Collection,2015-04-22 00:00:00
4,140607,Star Wars: The Force Awakens,2068.223624,245.0,Star Wars Collection,2015-12-15 00:00:00
5,19995,Avatar,2787.965087,237.0,Avatar Collection,2009-12-10 00:00:00
6,24428,The Avengers,1519.557910,220.0,The Avengers Collection,2012-04-25 00:00:00
7,597,Titanic,1845.034188,200.0,None,1997-11-18 00:00:00
8,284054,Black Panther,1346.739107,200.0,Black Panther Collection,2018-02-13 00:00:00
9,181808,Star Wars: The Last Jedi,1332.539889,200.0,Star Wars Collection,2017-12-13 00:00:00
10,260513,Incredibles 2,1241.891456,200.0,The Incredibles Collection,2018-06-14 00:00:00
11,168259,Furious 7,1515.047671,190.0,The Fast and the Furious Collection,2015-04-01 00:00:00
12,351286,Jurassic World: Fallen Kingdom,1303.459585,170.0,Jurassic Park Collection,2018-06-06 00:00:00
13,321612,Beauty and the Beast,1263.521126,160.0,None,2017-03-16 00:00:00
14,135397,Jurassic World,1671.713208,150.0,Jurassic Park Collection,2015-06-06 00:00:00
15,330457,Frozen II,1330.764959,150.0,Frozen Collection,2019-11-20 00:00:00
16,109445,Frozen,1274.219009,150.0,Frozen Collection,2013-11-27 00:00:00
17,12445,Harry Potter and the Deathly Hallows: Part 2,1341.511219,125.0,Harry Potter Collection,2011-07-07 00:00:00

__Load all movies (all columns) that do not belong to a collection.__

In [108]:
pd.read_sql('SELECT * FROM Movies WHERE belongs_to_collection_name IS  NULL', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,597,Titanic,1845.034188,200.0,None,1997-11-18 00:00:00
1,420818,The Lion King,1656.943394,260.0,None,2019-07-12 00:00:00
2,321612,Beauty and the Beast,1263.521126,160.0,None,2017-03-16 00:00:00

__Load all movies (all columns) that belong to a collection.__

In [101]:
pd.read_sql('SELECT belongs_to_collection_name FROM Movies', con).head(3)

  belongs_to_collection_name
0    The Avengers Collection
1          Avatar Collection
2       Star Wars Collection

__Load all movies (all columns) where "Avengers..." is in the title__.

In [104]:
pd.read_sql('SELECT * FROM Movies WHERE title LIKE "Avengers%" ', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,299534,Avengers: Endgame,2797.800564,356.0,The Avengers Collection,2019-04-24 00:00:00
1,299536,Avengers: Infinity War,2046.239637,300.0,The Avengers Collection,2018-04-25 00:00:00
2,99861,Avengers: Age of Ultron,1405.403694,250.0,The Avengers Collection,2015-04-22 00:00:00

## Join Queries

7. __Perform__ the following __SQL Join Queries__ and __store__ the results in DataFrames:

__Join "Movies" and "Votes"__ (all columns).

In [110]:
pd.read_sql('SELECT * FROM Movies JOIN Votes ON Movies.id = Votes.id', con)

,id,title,revenue,budget,belongs_to_collection_name,release_date,id,vote_count,vote_average
0,299534,Avengers: Endgame,2797.800564,356.0,The Avengers Collection,2019-04-24 00:00:00,299534,12607,8.3
1,19995,Avatar,2787.965087,237.0,Avatar Collection,2009-12-10 00:00:00,19995,21000,7.4
2,140607,Star Wars: The Force Awakens,2068.223624,245.0,Star Wars Collection,2015-12-15 00:00:00,140607,14205,7.4
3,299536,Avengers: Infinity War,2046.239637,300.0,The Avengers Collection,2018-04-25 00:00:00,299536,17718,8.3
4,597,Titanic,1845.034188,200.0,None,1997-11-18 00:00:00,597,16661,7.8
5,135397,Jurassic World,1671.713208,150.0,Jurassic Park Collection,2015-06-06 00:00:00,135397,15399,6.6
6,420818,The Lion King,1656.943394,260.0,None,2019-07-12 00:00:00,420818,5425,7.2
7,24428,The Avengers,1519.557910,220.0,The Avengers Collection,2012-04-25 00:00:00,24428,22101,7.7
8,168259,Furious 7,1515.047671,190.0,The Fast and the Furious Collection,2015-04-01 00:00:00,168259,7359,7.3
9,99861,Avengers: Age of Ultron,1405.403694,250.0,The Avengers Collection,2015-04-22 00:00:00,99861,15548,7.3
10,284054,Black Panther,1346.739107,200.0,Black Panther Collection,2018-02-13 00:00:00,284054,14830,7.4
11,12445,Harry Potter and the Deathly Hallows: Part 2,1341.511219,125.0,Harry Potter Collection,2011-07-07 00:00:00,12445,13447,8.1
12,181808,Star Wars: The Last Jedi,1332.539889,200.0,Star Wars Collection,2017-12-13 00:00:00,181808,10304,7.0
13,330457,Frozen II,1330.764959,150.0,Frozen Collection,2019-11-20 00:00:00,330457,3982,7.2
14,351286,Jurassic World: Fallen Kingdom,1303.459585,170.0,Jurassic Park Collection,2018-06-06 00:00:00,351286,7337,6.5
15,109445,Frozen,1274.219009,150.0,Frozen Collection,2013-11-27 00:00:00,109445,11616,7.3
16,321612,Beauty and the Beast,1263.521126,160.0,None,2017-03-16 00:00:00,321612,12203,6.9
17,260513,Incredibles 2,1241.891456,200.0,The Incredibles Collection,2018-06-14 00:00:00,260513,8147,7.5

__Join "Movies" and "Votes" (only the columns "id", "title", "vote_average").__

In [114]:
pd.read_sql('SELECT Movies.id, Movies.title, Votes.vote_average FROM Movies JOIN Votes ON Movies.id = Votes.id', con, index_col='id')

                                               title  vote_average
id
299534                             Avengers: Endgame           8.3
19995                                         Avatar           7.4
140607                  Star Wars: The Force Awakens           7.4
299536                        Avengers: Infinity War           8.3
597                                          Titanic           7.8
135397                                Jurassic World           6.6
420818                                 The Lion King           7.2
24428                                   The Avengers           7.7
168259                                     Furious 7           7.3
99861                        Avengers: Age of Ultron           7.3
284054                                 Black Panther           7.4
12445   Harry Potter and the Deathly Hallows: Part 2           8.1
181808                      Star Wars: The Last Jedi           7.0
330457                                     Frozen II           7.2
351286                Jurassic World: Fallen Kingdom           6.5
109445                                        Frozen           7.3
321612                          Beauty and the Beast           6.9
260513                                 Incredibles 2           7.5

__Join "Movies" and "Votes" (only the columns "id", "title", "vote_average") and return only those movies with vote_average > 8.__

In [115]:
pd.read_sql('SELECT Movies.id, Movies.title, Votes.vote_average FROM Movies JOIN Votes ON Movies.id = Votes.id WHERE vote_average>8', con, index_col='id')

                                               title  vote_average
id
299534                             Avengers: Endgame           8.3
299536                        Avengers: Infinity War           8.3
12445   Harry Potter and the Deathly Hallows: Part 2           8.1

__Join "Movies" and "Votes" (only the columns "id", "title", "vote_average") and return only those movies with vote_average > 8 and in ascending budget order__.

In [121]:
pd.read_sql('SELECT Movies.id, Movies.title, Votes.vote_average FROM Movies JOIN Votes ON Movies.id = Votes.id  WHERE Votes.vote_average>8 ORDER BY Movies.budget ASC', con, index_col='id')

                                               title  vote_average
id
12445   Harry Potter and the Deathly Hallows: Part 2           8.1
299536                        Avengers: Infinity War           8.3
299534                             Avengers: Endgame           8.3

## Final Case Study

8. __Perform__ the following advanced __SQL Queries__ and __store__ the results in DataFrames:

__Get the Total Revenue (sum) for each Production Company.__

__Get all Production Companies for the movie "Titanic".__

__Get the Total Revenue (sum) for each Genre.__

__Get all Genres for the movie "Frozen II".__

# +++++++++ See some Hints below +++++++++++++

# ++++++++++++++++ Hints++++++++++++++++++++

__Hints for 1.__<br>
You can do this with sq3.connect("database_name.db")

__Hints for 2.__ <br>
You have to use pd.json_normalize(data = ..., record_path = ..., meta = ..., record_prefix = ... ) for Datasets #3 and #4

__Hints for 3.__<br>
You can do this with:

In [ ]:
con = sq3.connect("movies.db")
df.to_sql("Table Name", con, index = False)

__Hints for 4.__<br>
You can do this with:

In [ ]:
con = sq3.connect("movies.db")
pd.read_sql("SELECT * FROM Table Name", con, index_col = ...)

__Hints for 5., 6., 7., 8.__<br>
You can do this with:

In [ ]:
con = sq3.connect("movies.db")
df = pd.read_sql("insert the sql query here", con)